# .zsh_plugins.txt - comments begin with "#"

# set up Zsh completions with plugins
zsh-users/zsh-completions kind:fpath path:src

# frameworks like oh-my-zsh are supported
getantidote/use-omz        # handle OMZ dependencies
ohmyzsh/ohmyzsh path:lib   # load OMZ's library
ohmyzsh/ohmyzsh path:plugins/git  # load OMZ plugins
ohmyzsh/ohmyzsh path:plugins/git-extras
ohmyzsh/ohmyzsh path:plugins/git-lfs
ohmyzsh/ohmyzsh path:plugins/direnv
ohmyzsh/ohmyzsh path:plugins/nvm

# popular fish-like plugins
mattmc3/zfunctions
zsh-users/zsh-syntax-highlighting
#zsh-users/zsh-autosuggestions
#marlonrichert/zsh-autocomplete
